app/Controllers/Crud.php

UPDATE `personajes` SET `id` = '2024-07-14 22:57:07', `fecha_actualizacion` = '2024-07-14 22:57:07'
WHERE `id` IN ('23')
AND `id` IS NULL
---
    public function update($id = null)
    {
        if (!$this->request->is('PUT') || $id == null) { //Si es GET O POST retorna a view crud
            return redirect()->to('crud');
        }

        // Establecer validaciones
        $reglas = [
            'nombre' => 'required|max_length[240]',
            'descripcion' => 'required',
        ];

        //Si las validaciones son incorrectas se manda un mensaje de error
        if (!$this->validate($reglas)) {
            return redirect()->back()->withInput()->with('error', 'Los datos son incorrectos (1)');
        }

        $fecha_actualizacion = date("Y-m-d H:i:s");

        // Preparar los datos a insertar
        $data = array(
            'nombre' => $this->request->getPost("nombre"),
            'descripcion' => $this->request->getPost("descripcion"),
            'fecha_actualizacion' => $fecha_actualizacion,
        );

        if ($this->personajes->update($id, $data)) {