app/Controllers/Crud.php

    public function create()
    {
        // Establecer validaciones
        $reglas = [
            'nombre' => 'required|max_length[240]',
            'descripcion' => 'required',
        ];

        //Si las validaciones son incorrectas se manda un mensaje de error
        if (!$this->validate($reglas)) {
            return redirect()->back()->withInput()->with('error', 'Los datos son incorrectos (1)');
        }

        $fecha_registro = date("Y-m-d H:i:s");
        $key_1 = "personajes-" . date("Y-m-d-H-i-s", strtotime($fecha_registro));
        $identificador_1 = hash("crc32b", $key_1);

        // Preparar los datos a insertar
        $data = array(
            'identificador' => $identificador_1,
            'nombre' => $this->request->getPost("nombre"),
            'descripcion' => $this->request->getPost("descripcion"),
            'fecha_registro' => $fecha_registro,
        );

        if ($this->personajes->insert($data)) {
---
INSERT INTO `personajes` (`identificador`, `nombre`, `descripcion`) VALUES ('d582952d', 'CAPITAN', 'SMFADSF')