app/Models/Personajes_model.php

   public function contar_registros()
   {
      $builder = $this->db->table('personajes');
      $builder = $builder->select('*');
      $personajes = $builder->get();
---
SELECT *
FROM `personajes`

   public function listar_limit($offset, $limit)
   {
      $builder = $this->db->table('personajes');
      $builder = $builder->select('*')->limit($offset, $limit);
      $personajes = $builder->get();
---
SELECT *
FROM `personajes`
 LIMIT 10, 10